eslint는 설치를 계속 시도하였는데도 실행이 안되서 일단 문제풀이 진행하였습니다.
월요일에 학원가서 설치는 마무리 짓겠습니다.
그리고 아직 풀지못한 문제들은 이후에도 계속 풀어보고 업로드할 생각합니다.

1. 변수 x가 10보다 크고 20보다 작을 때 변수 x를 출력하는 조건식을 완성하라
var x = 15;

변수 x가 10보다 크고 20보다 작을 때 변수 x를 출력하는 조건식을 완성하라.
if(10 < x < 20) {
  console.log(x);
}

2. for문을 사용하여 0부터 10미만의 정수중에서 짝수만을 작은 수부터 출력하시오.
for(var i = 0; i < 10; i+=2){
  console.log(i);
}

3. for문을 사용하여 0부터 10미만의 정수 중에서 짝수만을 작은 수부터 문자열로 출력하시오.
let a = ''; 
for(var i = 0; i < 10; i+=2){
  a += i;
}
console.log(a);

4. for문을 사용하여 0부터 10미만의 정수 중에서 홀수만을 큰수부터 출력하시오.
for(var i = 9; i >= 1; i-=2){
  console.log(i);
}

5. while문을 사용하여 0 부터 10 미만의 정수 중에서 짝수만을 작은 수부터 출력하시오.

6. while문을 사용하여 0 부터 10 미만의 정수 중에서 홀수만을 큰수부터 출력하시오.

7. for 문을 사용하여 0부터 10미만의 정수의 합을 출력하시오.

8. 1부터 20 미만의 정수 중에서 2 또는 3의 배수가 아닌 수의 총합을 구하시오.

9. 1부터 20 미만의 정수 중에서 2 또는 3의 배수인 수의 총합을 구하시오.

10. 두 개의 주사위를 던졌을 때, 눈의 합이 6이 되는 모든 경우의 수를 출력하시오.

11. 삼각형 출력하기 - pattern 1

12. 삼각형 출력하기 - pattern 2

13. 삼각형 출력하기 - pattern 3

14. 삼각형 출력하기 - pattern 4

15. 정삼각형 출력하기

16. 역정삼각형 출력하기

